app/controllers/readings_controller.rb

  def index
    @thermostat = Thermostat.all
---
SELECT "thermostats".* FROM "thermostats"

  def show
    reader = $redis.get(params[:id]) || Reader.find_by_number(params[:id])
---
SELECT  "readers".* FROM "readers" WHERE "readers"."number" = $1 LIMIT $2  [["number", 1], ["LIMIT", 1]]

    def data_store
      data = []
      aggregation = @thermostat.readers.pluck('Avg(temperature)', 'Min(temperature)', 'Max(temperature)', 'Avg(humidity)', 'Min(humidity)', 'Max(humidity)', 'Avg(battery_charge)', 'Min(battery_charge)', 'Max(battery_charge)').first
---
SELECT Avg(temperature), Min(temperature), Max(temperature), Avg(humidity), Min(humidity), Max(humidity), Avg(battery_charge), Min(battery_charge), Max(battery_charge) FROM "readers" WHERE "readers"."thermostat_id" = $1  [["thermostat_id", 1]]