app/models/reader.rb

  def self.find_by_number number
    self.find_by(number: number)
---
SELECT  "readers".* FROM "readers" WHERE "readers"."number" = $1 LIMIT $2  [["number", 1], ["LIMIT", 1]]