app/models/thermostat.rb

SELECT  "thermostats".* FROM "thermostats" WHERE "thermostats"."household_token" = $1 LIMIT $2  [["household_token", "ee046bde-c530-4491-a997-52d6f1b656b7"], ["LIMIT", 1]]
---
  def self.fetch_by_household_token token
    self.find_by(household_token: token)